In [1]:
# ------------------------------------
# 결측치 처리 (1) 치환
# searbon에서 제공하는 Titanic 데이터 사용
# ------------------------------------
import pandas as pd
import seaborn as sns
import numpy as np

In [37]:
# ----------------------
# 데이터 로딩
titanicDF = sns.load_dataset('titanic')

In [38]:
# 데이터 확인 -------------------------------
titanicDF.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [5]:
# 실제 데이터 확인
titanicDF.head()

# 남자와 여자중에서 누가 더 생존자가 많은지? 
# 내가 이걸 가지고 뭘 분석 할 것인지?

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [13]:
# 결측치를 치환
# 타입도 바꿔야하고

missingData = titanicDF.isnull().sum()
#결측지가 있는 것만 뽑고싶다.
type(missingData)
# titanicDF.notnull().sum()

pandas.core.series.Series

In [18]:
missingData > 0
# missingData
#결측지가 존재하는 데이터만 추출
#True/False로 구성된 불인덱싱(Boolean Indexing)
FILLTER = missingData > 0
MASK = missingData > 100
missingData[missingData > 0]
missingData[MASK]

age     177
deck    688
dtype: int64

In [20]:
# 결측치가 존재하는 컬럼의 값을 치환해서 결측치를 없애기 --------------------------
# => fillna() 메서드
missingData[FILLTER].index

Index(['age', 'embarked', 'deck', 'embark_town'], dtype='object')

In [39]:
# age 컬럼 결측치 커리
# titanicDF['age'].fillna(0).isnull().sum() #inplace 적용여부
titanicDF['age'].fillna(0)#inplace 적용여부

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     0.0
889    26.0
890    32.0
Name: age, Length: 891, dtype: float64

In [44]:
# fillna(치환값) => 본인이 결정 평균 : mean()

titanicDF.age.mean()

titanicDF['age'].fillna(titanicDF.age.mean())

0      22.000000
1      38.000000
2      26.000000
3      35.000000
4      35.000000
         ...
886    27.000000
887    19.000000
888    29.699118
889    26.000000
890    32.000000
Name: age, Length: 891, dtype: float64

In [33]:
# titanicDF['age'].fillna()
modeValue =titanicDF.age.mode()
titanicDF.age.fillna(modeValue[0])

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888    24.0
889    26.0
890    32.0
Name: age, Length: 891, dtype: float64

In [48]:
# fillna(치환값) => method 매개변수 'ffill' 앞에껄로 채워라
# 'bfill' 뒤에 것으로 채워라

titanicDF.age.fillna(method='ffill')
titanicDF.age.fillna(method='bfill')

titanicDF.survived.value_counts()

0    549
1    342
Name: survived, dtype: int64

In [42]:
# Index(['age', 'embarked', 'deck', 'embark_town'], dtype='object')
# 결측치처리!
FILE = '../dataFiles/auto-mpg.csv'
mpgDF = pd.read_csv(FILE)
#mode # 최빈값

mpgDF.mode()

   18.0    8  307.0   76.0   3504.  12.0    70    1 chevrolet chevelle malibu
0  13.0  4.0   97.0  150.0  1985.0  14.5  73.0  1.0                ford pinto
1   NaN  NaN    NaN  90.00  2130.0   NaN   NaN  NaN                       NaN

In [46]:
mpgDF['76.0'].value_counts()

90.00    20
150.0    20
88.00    19
110.0    18
100.0    17
         ..
91.00     1
122.0     1
61.00     1
93.00     1
82.00     1
Name: 76.0, Length: 97, dtype: int64

In [51]:
mpgDF['18.0'].value_counts()

13.0    20
14.0    19
15.0    16
18.0    16
26.0    14
        ..
31.9     1
16.9     1
18.2     1
22.3     1
44.0     1
Name: 18.0, Length: 129, dtype: int64

In [54]:
mpgDF['18.0'].mode()[0]

13.0

In [55]:
import matplotlib.pyplot as plt